<template>
  <footer>
    <!-- component -->

    <section class="bg-white dark:bg-gray-900">
      <div class="container px-6 py-12 mx-auto">
        <div class="grid grid-cols-1 gap-8 md:grid-cols-2 lg:grid-cols-3">
          <div>
            <main class="flex">
              <svg class="w-8 h-8" viewBox="0 0 30 30" fill="none">
                <path
                  d="M29.6931 14.2283L22.7556 6.87823C22.3292 6.426 21.6175 6.40538 21.1652 6.83212C20.7137 7.25851 20.6927 7.9706 21.1195 8.42248L27.3284 15L21.1195 21.5783C20.6927 22.0302 20.7137 22.7419 21.1652 23.1687C21.3827 23.3738 21.6606 23.4754 21.9374 23.4754C22.2363 23.4754 22.5348 23.3569 22.7557 23.1233L29.6932 15.7729C30.1022 15.339 30.1023 14.6618 29.6931 14.2283Z"
                  fill="#2D3748"
                />
                <path
                  d="M8.88087 21.578L2.67236 15L8.88087 8.42215C9.30726 7.97028 9.28664 7.25812 8.83476 6.83179C8.38323 6.4054 7.67073 6.42603 7.2444 6.87791L0.306858 14.2279C-0.102245 14.6614 -0.102245 15.3391 0.306858 15.7726L7.24475 23.123C7.466 23.3574 7.76413 23.4755 8.06302 23.4755C8.33976 23.4755 8.61767 23.3735 8.83476 23.1684C9.28705 22.742 9.30726 22.0299 8.88087 21.578Z"
                  fill="#2D3748"
                />
                <path
                  d="M16.8201 3.08774C16.2062 2.99476 15.6317 3.41622 15.5379 4.03011L12.2379 25.6302C12.1441 26.2445 12.566 26.8186 13.1803 26.9124C13.238 26.921 13.295 26.9252 13.3516 26.9252C13.898 26.9252 14.3773 26.5266 14.4624 25.97L17.7624 4.3699C17.8562 3.7556 17.4343 3.1815 16.8201 3.08774Z"
                  fill="#4299E1"
                />
              </svg>

              <h1 class="ml-1 text-xl font-semibold text-gray-800 dark:text-white">
                Up to 4 Years Interest Free Credit
              </h1>
            </main>

            <p class="mt-2 text-gray-500 dark:text-gray-400">
              0% APR Representative. T&Cs Apply
            </p>
          </div>

          <div>
            <main class="flex">
              <svg class="w-8 h-8" viewBox="0 0 30 30" fill="none">
                <path
                  d="M27.3633 7.08984H26.4844V6.21094C26.4844 4.75705 25.3015 3.57422 23.8477 3.57422H4.39453C2.94064 3.57422 1.75781 4.75705 1.75781 6.21094V21.1523H0.878906C0.393516 21.1523 0 21.5459 0 22.0312V23.7891C0 25.2429 1.18283 26.4258 2.63672 26.4258H27.3633C28.8172 26.4258 30 25.2429 30 23.7891V9.72656C30 8.27268 28.8172 7.08984 27.3633 7.08984ZM3.51562 6.21094C3.51562 5.72631 3.9099 5.33203 4.39453 5.33203H23.8477C24.3323 5.33203 24.7266 5.72631 24.7266 6.21094V7.08984H20.332C18.8781 7.08984 17.6953 8.27268 17.6953 9.72656V21.1523H3.51562V6.21094ZM1.75781 23.7891V22.9102H17.6953V23.7891C17.6953 24.0971 17.7489 24.3929 17.8465 24.668H2.63672C2.15209 24.668 1.75781 24.2737 1.75781 23.7891ZM28.2422 23.7891C28.2422 24.2737 27.8479 24.668 27.3633 24.668H20.332C19.8474 24.668 19.4531 24.2737 19.4531 23.7891V9.72656C19.4531 9.24193 19.8474 8.84766 20.332 8.84766H27.3633C27.8479 8.84766 28.2422 9.24193 28.2422 9.72656V23.7891Z"
                  fill="#2D3748"
                />
                <path
                  d="M24.7266 21.1523H22.9688C22.4834 21.1523 22.0898 21.5459 22.0898 22.0312C22.0898 22.5166 22.4834 22.9102 22.9688 22.9102H24.7266C25.212 22.9102 25.6055 22.5166 25.6055 22.0312C25.6055 21.5459 25.212 21.1523 24.7266 21.1523Z"
                  fill="#4299E1"
                />
                <path
                  d="M23.8477 12.3633C24.3331 12.3633 24.7266 11.9698 24.7266 11.4844C24.7266 10.999 24.3331 10.6055 23.8477 10.6055C23.3622 10.6055 22.9688 10.999 22.9688 11.4844C22.9688 11.9698 23.3622 12.3633 23.8477 12.3633Z"
                  fill="#4299E1"
                />
              </svg>

              <h1 class="ml-1 text-xl font-semibold text-gray-800 dark:text-white">
                Free Next Day Delivery Until 9PM
              </h1>
            </main>

            <p class="mt-2 text-gray-500 dark:text-gray-400">
              Monday - Sunday Nationwide
            </p>
          </div>

          <div>
            <main class="flex">
              <svg class="w-8 h-8" viewBox="0 0 30 30" fill="none">
                <g clip-path="url(#clip0)">
                  <path
                    d="M26.599 4.339a1.875 1.875 0 11-3.75 0 1.875 1.875 0 013.75 0zM7.151 25.661a1.875 1.875 0 11-3.75 0 1.875 1.875 0 013.75 0zM23.486 13.163a8.636 8.636 0 00-1.19-2.873l1.123-1.123-2.592-2.59L19.705 7.7a8.636 8.636 0 00-2.873-1.19V4.921h-3.664v1.586a8.634 8.634 0 00-2.873 1.19l-1.122-1.12-2.592 2.589 1.123 1.123a8.636 8.636 0 00-1.19 2.873H4.922l-.002 3.663h1.592A8.626 8.626 0 007.704 19.7l-1.127 1.127 2.59 2.591 1.128-1.127a8.623 8.623 0 002.873 1.19v1.597h3.664v-1.597a8.628 8.628 0 002.873-1.19l1.128 1.128 2.59-2.592-1.127-1.127a8.627 8.627 0 001.19-2.873h1.593v-3.664h-1.593zM15 19.256a4.255 4.255 0 110-8.511 4.255 4.255 0 010 8.51z"
                    fill="#4299E1"
                  />
                  <path
                    d="M5.276 23.2c-.42 0-.823.105-1.182.302A13.853 13.853 0 011.172 15C1.172 7.375 7.375 1.172 15 1.172c.927 0 1.854.092 2.754.274a.586.586 0 00.232-1.149A15.111 15.111 0 0015 0C10.993 0 7.226 1.56 4.393 4.393A14.902 14.902 0 000 15c0 3.37 1.144 6.66 3.228 9.296-.268.4-.413.872-.413 1.365 0 .657.257 1.275.721 1.74a2.444 2.444 0 001.74.721c.658 0 1.276-.256 1.74-.721.465-.465.721-1.083.721-1.74s-.256-1.276-.72-1.74a2.445 2.445 0 00-1.74-.72zm.912 3.373a1.28 1.28 0 01-.912.377 1.28 1.28 0 01-.911-.377 1.28 1.28 0 01-.378-.912c0-.344.134-.668.378-.912a1.28 1.28 0 01.911-.377c.345 0 .668.134.912.378.243.243.377.567.377.911 0 .344-.134.668-.377.912zM26.772 5.703a2.465 2.465 0 00-.308-3.104 2.446 2.446 0 00-1.74-.721c-.658 0-1.276.256-1.74.72a2.445 2.445 0 00-.721 1.74c0 .658.256 1.276.72 1.741.465.465 1.083.72 1.74.72.42 0 .824-.104 1.183-.3A13.854 13.854 0 0128.828 15c0 7.625-6.203 13.828-13.828 13.828-.918 0-1.836-.09-2.728-.269a.586.586 0 00-.23 1.15c.968.193 1.963.291 2.958.291 4.007 0 7.773-1.56 10.607-4.393A14.902 14.902 0 0030 15c0-3.37-1.145-6.66-3.228-9.297zm-2.96-.452a1.28 1.28 0 01-.377-.912c0-.344.134-.668.377-.911a1.28 1.28 0 01.912-.378 1.29 1.29 0 010 2.578 1.28 1.28 0 01-.912-.377z"
                    fill="#2D3748"
                  />
                  <path
                    d="M12.582 25.078c0 .324.263.586.586.586h3.664a.586.586 0 00.586-.586v-1.136a9.179 9.179 0 002.199-.911l.802.802a.586.586 0 00.829 0l2.59-2.592a.586.586 0 000-.828l-.802-.802a9.169 9.169 0 00.911-2.199h1.132a.586.586 0 00.586-.585v-3.664a.586.586 0 00-.586-.586h-1.132a9.17 9.17 0 00-.911-2.199l.797-.797a.587.587 0 000-.829l-2.592-2.59a.586.586 0 00-.829 0l-.795.797a9.177 9.177 0 00-2.2-.912V4.922a.586.586 0 00-.585-.586h-3.664a.586.586 0 00-.586.586v1.126a9.169 9.169 0 00-2.199.91l-.796-.795a.586.586 0 00-.828 0l-2.592 2.59a.585.585 0 000 .828l.797.797a9.173 9.173 0 00-.911 2.199h-1.13a.586.586 0 00-.586.585l-.002 3.664a.585.585 0 00.586.586h1.132c.207.77.512 1.507.911 2.2l-.801.8a.586.586 0 000 .83l2.59 2.59a.586.586 0 00.829 0l.801-.801a9.185 9.185 0 002.2.911v1.136zm-1.97-3.28a.586.586 0 00-.732.078l-.713.714-1.761-1.763.712-.713a.586.586 0 00.078-.732 8.02 8.02 0 01-1.11-2.679.586.586 0 00-.572-.462H5.507l.002-2.492h1.005a.586.586 0 00.572-.463 8.022 8.022 0 011.11-2.678.586.586 0 00-.078-.733l-.708-.708 1.763-1.761.707.707c.196.196.5.228.733.078a8.016 8.016 0 012.678-1.11.586.586 0 00.463-.573v-1h2.492v1c0 .277.193.515.463.573a8.024 8.024 0 012.678 1.11c.232.15.537.118.732-.078l.708-.707 1.762 1.761-.708.708a.586.586 0 00-.078.732 8.027 8.027 0 011.11 2.679c.058.27.297.463.573.463h1.007v2.492h-1.007a.586.586 0 00-.573.462 8.02 8.02 0 01-1.11 2.679.586.586 0 00.078.732l.713.713-1.761 1.762-.714-.713a.586.586 0 00-.732-.078 8.027 8.027 0 01-2.678 1.11.586.586 0 00-.463.573v1.011h-2.492v-1.01a.586.586 0 00-.463-.574 8.021 8.021 0 01-2.678-1.11z"
                    fill="#2D3748"
                  />
                  <path
                    d="M19.841 15A4.847 4.847 0 0015 10.158 4.847 4.847 0 0010.158 15 4.847 4.847 0 0015 19.841 4.847 4.847 0 0019.841 15zm-8.51 0A3.674 3.674 0 0115 11.33 3.674 3.674 0 0118.67 15 3.674 3.674 0 0115 18.67 3.674 3.674 0 0111.33 15z"
                    fill="#2D3748"
                  />
                  <path
                    d="M20.395 2.216a.59.59 0 00.415-.172.593.593 0 00.171-.415.59.59 0 00-.586-.586.589.589 0 00-.586.586.589.589 0 00.586.587zM9.63 27.794a.59.59 0 00-.586.586.59.59 0 00.586.586.59.59 0 00.586-.586.59.59 0 00-.586-.585z"
                    fill="#4299E1"
                  />
                </g>
                <defs>
                  <clipPath id="clip0">
                    <path fill="#fff" d="M0 0h30v30H0z" />
                  </clipPath>
                </defs>
              </svg>

              <h1 class="ml-1 text-xl font-semibold text-gray-800 dark:text-white">
                Click & Collect Service
              </h1>
            </main>

            <p class="mt-2 text-gray-500 dark:text-gray-400">
              From over 40 Showrooms Nationwide
            </p>
          </div>
        </div>
      </div>
    </section>
    <section class="bg-white dark:bg-gray-900">
      <div class="container px-6 py-10 mx-auto">
        <div
          class="grid grid-cols-1 gap-8 mt-8 xl:mt-12 xl:gap-12 md:grid-cols-2 xl:grid-cols-3"
        >
          <div class="p-8 space-y-3 border-2 footer-money rounded-xl">
            <main class="flex">
              <svg
                width="32"
                height="32"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M6 14.25C5.58579 14.25 5.25 14.5858 5.25 15C5.25 15.4142 5.58579 15.75 6 15.75V14.25ZM10 15.75C10.4142 15.75 10.75 15.4142 10.75 15C10.75 14.5858 10.4142 14.25 10 14.25V15.75ZM5 6.75H19V5.25H5V6.75ZM19 17.25H5V18.75H19V17.25ZM20.25 8V10H21.75V8H20.25ZM20.25 10V16H21.75V10H20.25ZM3.75 16V10H2.25V16H3.75ZM3.75 10V8H2.25V10H3.75ZM5 17.25C4.30964 17.25 3.75 16.6904 3.75 16H2.25C2.25 17.5188 3.48122 18.75 5 18.75V17.25ZM19 18.75C20.5188 18.75 21.75 17.5188 21.75 16H20.25C20.25 16.6904 19.6904 17.25 19 17.25V18.75ZM19 6.75C19.6904 6.75 20.25 7.30964 20.25 8H21.75C21.75 6.48122 20.5188 5.25 19 5.25V6.75ZM5 5.25C3.48122 5.25 2.25 6.48122 2.25 8H3.75C3.75 7.30964 4.30964 6.75 5 6.75V5.25ZM21 9.25H3V10.75H21V9.25ZM6 15.75H10V14.25H6V15.75Z"
                  fill="#001A72"
                />
              </svg>

              <h1 class="ml-1 text-xl font-semibold text-gray-800 dark:text-white">
                Up to 4 Years Interest Free Credit
              </h1>
            </main>
            <p class="mt-2 text-gray-500 dark:text-gray-400">
              0% APR Representative. T&Cs Apply
            </p>
          </div>

          <div class="p-8 space-y-3 border-2 footer-money rounded-xl">
            <main class="flex">
              <svg
                width="32"
                height="32"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M4.5 3L5.24246 2.89393C5.18968 2.52445 4.87324 2.25 4.5 2.25V3ZM2 2.25C1.58579 2.25 1.25 2.58579 1.25 3C1.25 3.41421 1.58579 3.75 2 3.75V2.25ZM6.5 17L5.75754 17.1061C5.81032 17.4756 6.12676 17.75 6.5 17.75V17ZM21 5L21.7115 5.23717C21.7877 5.00846 21.7494 4.75704 21.6084 4.56147C21.4675 4.36589 21.2411 4.25 21 4.25V5ZM18 14V14.75C18.3228 14.75 18.6094 14.5434 18.7115 14.2372L18 14ZM6.07142 13.25C5.65721 13.25 5.32142 13.5858 5.32142 14C5.32142 14.4142 5.65721 14.75 6.07142 14.75V13.25ZM4.78571 4.25C4.37149 4.25 4.03571 4.58579 4.03571 5C4.03571 5.41421 4.37149 5.75 4.78571 5.75V4.25ZM4.5 2.25H2V3.75H4.5V2.25ZM6.5 17.75H17V16.25H6.5V17.75ZM7.24246 16.8939L5.24246 2.89393L3.75754 3.10607L5.75754 17.1061L7.24246 16.8939ZM20.2885 4.76283L17.2885 13.7628L18.7115 14.2372L21.7115 5.23717L20.2885 4.76283ZM18 13.25H6.07142V14.75H18V13.25ZM4.78571 5.75H21V4.25H4.78571V5.75ZM10.25 19C10.25 19.6904 9.69036 20.25 9 20.25V21.75C10.5188 21.75 11.75 20.5188 11.75 19H10.25ZM9 20.25C8.30964 20.25 7.75 19.6904 7.75 19H6.25C6.25 20.5188 7.48122 21.75 9 21.75V20.25ZM7.75 19C7.75 18.3096 8.30964 17.75 9 17.75V16.25C7.48122 16.25 6.25 17.4812 6.25 19H7.75ZM9 17.75C9.69036 17.75 10.25 18.3096 10.25 19H11.75C11.75 17.4812 10.5188 16.25 9 16.25V17.75ZM18.25 19C18.25 19.6904 17.6904 20.25 17 20.25V21.75C18.5188 21.75 19.75 20.5188 19.75 19H18.25ZM17 20.25C16.3096 20.25 15.75 19.6904 15.75 19H14.25C14.25 20.5188 15.4812 21.75 17 21.75V20.25ZM15.75 19C15.75 18.3096 16.3096 17.75 17 17.75V16.25C15.4812 16.25 14.25 17.4812 14.25 19H15.75ZM17 17.75C17.6904 17.75 18.25 18.3096 18.25 19H19.75C19.75 17.4812 18.5188 16.25 17 16.25V17.75Z"
                  fill="#001A72"
                />
              </svg>

              <h1 class="ml-1 text-xl font-semibold text-gray-800 dark:text-white">
                Free Next Day Delivery Until 9PM
              </h1>
            </main>

            <p class="mt-2 text-gray-500 dark:text-gray-400">
              Monday - Sunday Nationwide
            </p>
          </div>

          <div class="p-8 space-y-3 border-2 footer-money rounded-xl">
            <main class="flex">
              <svg
                width="32"
                height="32"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M5 20.0802H4.25C4.25 20.4944 4.58579 20.8302 5 20.8302V20.0802ZM19 20.0802V20.8302C19.4142 20.8302 19.75 20.4944 19.75 20.0802H19ZM4 10.0802H3.25C3.25 10.4944 3.58579 10.8302 4 10.8302V10.0802ZM4 7.0802V6.3302C3.58579 6.3302 3.25 6.66599 3.25 7.0802H4ZM20 7.0802H20.75C20.75 6.66599 20.4142 6.3302 20 6.3302V7.0802ZM20 10.0802V10.8302C20.4142 10.8302 20.75 10.4944 20.75 10.0802H20ZM12 7.0802L11.9501 7.82854C11.9833 7.83075 12.0167 7.83075 12.0499 7.82854L12 7.0802ZM5 20.8302H19V19.3302H5V20.8302ZM19.75 20.0802V10.0802H18.25V20.0802H19.75ZM19 9.3302H5V10.8302H19V9.3302ZM4.25 10.0802V20.0802H5.75V10.0802H4.25ZM5 9.3302H4V10.8302H5V9.3302ZM4.75 10.0802V7.0802H3.25V10.0802H4.75ZM4 7.8302H20V6.3302H4V7.8302ZM19.25 7.0802V10.0802H20.75V7.0802H19.25ZM20 9.3302H19V10.8302H20V9.3302ZM12.6828 7.39055C13.0881 6.49886 13.7934 5.22245 14.5928 4.42302C14.9952 4.02063 15.3474 3.81451 15.6273 3.76323C15.8477 3.72283 16.1175 3.75848 16.4695 4.11053L17.5302 3.04987C16.8823 2.40192 16.1312 2.14591 15.3569 2.2878C14.642 2.41881 14.0255 2.86894 13.5321 3.36238C12.5399 4.35461 11.7452 5.82821 11.3172 6.76985L12.6828 7.39055ZM16.4695 4.11053C16.659 4.29995 16.7204 4.43143 16.7392 4.49898C16.754 4.55188 16.7512 4.59129 16.7273 4.64564C16.6566 4.80664 16.4048 5.06564 15.8473 5.34925C14.7763 5.89416 13.133 6.253 11.9501 6.33186L12.0499 7.82854C13.367 7.74073 15.2236 7.34958 16.5275 6.68616C17.1576 6.3656 17.812 5.90584 18.1006 5.24913C18.2564 4.89464 18.2966 4.50045 18.1844 4.09697C18.0762 3.70814 17.8408 3.36045 17.5302 3.04987L16.4695 4.11053ZM12.6828 6.76985C12.2548 5.8282 11.4601 4.3546 10.4678 3.36237C9.97438 2.86893 9.35793 2.41881 8.64298 2.2878C7.86869 2.14591 7.11761 2.40192 6.46966 3.04987L7.53032 4.11053C7.88236 3.75848 8.15212 3.72282 8.37262 3.76323C8.65247 3.81451 9.00477 4.02064 9.40716 4.42303C10.2066 5.22247 10.9119 6.49887 11.3172 7.39055L12.6828 6.76985ZM6.46966 3.04987C6.15907 3.36046 5.92367 3.70815 5.81551 4.09698C5.70327 4.50047 5.74351 4.89466 5.89931 5.24915C6.18793 5.90586 6.84234 6.3656 7.4724 6.68616C8.77637 7.34958 10.633 7.74073 11.9501 7.82854L12.0499 6.33186C10.867 6.253 9.22363 5.89416 8.15259 5.34924C7.59514 5.06563 7.3433 4.80663 7.27254 4.64563C7.24865 4.59127 7.24592 4.55186 7.26064 4.49897C7.27943 4.43142 7.3409 4.29995 7.53032 4.11053L6.46966 3.04987Z"
                  fill="#001A72"
                />
              </svg>

              <h1 class="ml-1 text-xl font-semibold text-gray-800 dark:text-white">
                Click & Collect Service
              </h1>
            </main>

            <p class="mt-2 text-gray-500 dark:text-gray-400">
              From over 40 Showrooms Nationwide
            </p>
          </div>
        </div>
      </div>
    </section>

    <div class="bg-gray-200">
      <div class="container mx-auto px-6 py-3 flex justify-center items-center">
        <p class="py-2 text-gray-500 sm:py-0 text-sm">
          <a href="#">
            &nbsp;
            <!-- 圖片僅供學習使用，無商業用途。<br /> -->
          </a>
        </p>
        <!-- <p class="py-2 text-gray-500 sm:py-0">
          本網站為Vigilero權所有，未經允許不得以任何形式複製和採用，圖片僅供學習使用，無商業用途。Copyright
          © 2022 Vigilero All rights resevered.
        </p> -->
      </div>
    </div>
    <div class="pt-8 bg-gradient-to-b from-gray-100 to-sky-900 md:pt-20">
      <div class="container m-auto px-6 space-y-8 text-gray-400 md:px-12 lg:px-20">
        <div>
          <div
            class="mb-6 gap-6 items-center justify-between py-6 sm:flex md:mb-16 md:py-0 md:space-y-6"
          >
            <!-- <img
              width="100"
              height="42"
              src="images/logo.svg"
              alt="logo tailus"
              class="w-32"
            /> -->
            <div
              class="flex flex-wrap flex-col-reverse gap-6 mt-6 sm:flex-row sm:mt-0 sm:items-center"
            >
              <select
                name="langage"
                id="langae"
                class="px-4 py-2 w-full rounded-xl bg-gray-900 sm:w-max"
              >
                <option value="en">English</option>
                <option value="fr">French</option>
                <option value="sw">Swahili</option>
              </select>
              <div class="flex gap-6">
                <a
                  href="#"
                  target="blank"
                  aria-label="github"
                  class="hover:text-cyan-400"
                >
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="20"
                    height="20"
                    fill="currentColor"
                    class="bi bi-github"
                    viewBox="0 0 16 16"
                  >
                    <path
                      d="M8 0C3.58 0 0 3.58 0 8c0 3.54 2.29 6.53 5.47 7.59.4.07.55-.17.55-.38 0-.19-.01-.82-.01-1.49-2.01.37-2.53-.49-2.69-.94-.09-.23-.48-.94-.82-1.13-.28-.15-.68-.52-.01-.53.63-.01 1.08.58 1.23.82.72 1.21 1.87.87 2.33.66.07-.52.28-.87.51-1.07-1.78-.2-3.64-.89-3.64-3.95 0-.87.31-1.59.82-2.15-.08-.2-.36-1.02.08-2.12 0 0 .67-.21 2.2.82.64-.18 1.32-.27 2-.27.68 0 1.36.09 2 .27 1.53-1.04 2.2-.82 2.2-.82.44 1.1.16 1.92.08 2.12.51.56.82 1.27.82 2.15 0 3.07-1.87 3.75-3.65 3.95.29.25.54.73.54 1.48 0 1.07-.01 1.93-.01 2.2 0 .21.15.46.55.38A8.012 8.012 0 0 0 16 8c0-4.42-3.58-8-8-8z"
                    />
                  </svg>
                </a>
                <a
                  href="#"
                  target="blank"
                  aria-label="twitter"
                  class="hover:text-cyan-400"
                >
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="20"
                    height="20"
                    fill="currentColor"
                    class="bi bi-twitter"
                    viewBox="0 0 16 16"
                  >
                    <path
                      d="M5.026 15c6.038 0 9.341-5.003 9.341-9.334 0-.14 0-.282-.006-.422A6.685 6.685 0 0 0 16 3.542a6.658 6.658 0 0 1-1.889.518 3.301 3.301 0 0 0 1.447-1.817 6.533 6.533 0 0 1-2.087.793A3.286 3.286 0 0 0 7.875 6.03a9.325 9.325 0 0 1-6.767-3.429 3.289 3.289 0 0 0 1.018 4.382A3.323 3.323 0 0 1 .64 6.575v.045a3.288 3.288 0 0 0 2.632 3.218 3.203 3.203 0 0 1-.865.115 3.23 3.23 0 0 1-.614-.057 3.283 3.283 0 0 0 3.067 2.277A6.588 6.588 0 0 1 .78 13.58a6.32 6.32 0 0 1-.78-.045A9.344 9.344 0 0 0 5.026 15z"
                    />
                  </svg>
                </a>
                <a
                  href="#"
                  target="blank"
                  aria-label="medium"
                  class="hover:text-cyan-400"
                >
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="20"
                    height="20"
                    fill="currentColor"
                    class="bi bi-medium"
                    viewBox="0 0 16 16"
                  >
                    <path
                      d="M9.025 8c0 2.485-2.02 4.5-4.513 4.5A4.506 4.506 0 0 1 0 8c0-2.486 2.02-4.5 4.512-4.5A4.506 4.506 0 0 1 9.025 8zm4.95 0c0 2.34-1.01 4.236-2.256 4.236-1.246 0-2.256-1.897-2.256-4.236 0-2.34 1.01-4.236 2.256-4.236 1.246 0 2.256 1.897 2.256 4.236zM16 8c0 2.096-.355 3.795-.794 3.795-.438 0-.793-1.7-.793-3.795 0-2.096.355-3.795.794-3.795.438 0 .793 1.699.793 3.795z"
                    />
                  </svg>
                </a>
              </div>
            </div>
          </div>
          <div>
            <div class="pb-16 grid grid-cols-2 gap-6 sm:grid-cols-3 md:grid-cols-5">
              <div>
                <h6 class="text-lg font-medium text-gray-600">Contact</h6>
                <ul class="list-inside mt-4 space-y-4">
                  <li>
                    <a href="#" class="hover:text-cyan-400 transition">About</a>
                  </li>
                  <li>
                    <a href="#" class="hover:text-cyan-400 transition">Customers</a>
                  </li>
                  <li>
                    <a href="#" class="hover:text-cyan-400 transition">Enterprise</a>
                  </li>
                  <li>
                    <a href="#" class="hover:text-cyan-400 transition">Partners</a>
                  </li>
                  <li>
                    <a href="#" class="hover:text-cyan-400 transition">Jobs</a>
                  </li>
                </ul>
              </div>
              <div>
                <h6 class="text-lg font-medium text-gray-600">Products</h6>
                <ul class="list-inside mt-4 space-y-4">
                  <li>
                    <a href="#" class="hover:text-cyan-400 transition">About</a>
                  </li>
                  <li>
                    <a href="#" class="hover:text-cyan-400 transition">Customers</a>
                  </li>
                  <li>
                    <a href="#" class="hover:text-cyan-400 transition">Enterprise</a>
                  </li>
                  <li>
                    <a href="#" class="hover:text-cyan-400 transition">Partners</a>
                  </li>
                  <li>
                    <a href="#" class="hover:text-cyan-400 transition">Jobs</a>
                  </li>
                </ul>
              </div>
              <div>
                <h6 class="text-lg font-medium text-gray-600">Ressources</h6>
                <ul class="list-inside mt-4 space-y-4">
                  <li>
                    <a href="#" class="hover:text-cyan-400 transition">About</a>
                  </li>
                  <li>
                    <a href="#" class="hover:text-cyan-400 transition">Customers</a>
                  </li>
                  <li>
                    <a href="#" class="hover:text-cyan-400 transition">Enterprise</a>
                  </li>
                  <li>
                    <a href="#" class="hover:text-cyan-400 transition">Partners</a>
                  </li>
                  <li>
                    <a href="#" class="hover:text-cyan-400 transition">Jobs</a>
                  </li>
                </ul>
              </div>
              <div class="col-span-2 sm:col-span-3 md:col-span-2">
                <h6 class="text-lg font-medium text-gray-600">Contact</h6>
                <ul class="list-inside mt-4 space-y-4">
                  <li>
                    <a href="tel:+243996660436" class="hover:text-cyan-400 transition"
                      >+243 996 660 436</a
                    >
                  </li>
                  <li>
                    <a
                      href="mailto:meschacirung@gmail.com"
                      class="hover:text-cyan-400 transition"
                      >contact@tailus.com</a
                    >
                  </li>
                  <li>
                    <form action="">
                      <label for="newsletter" class="text-lg text-gray-600"
                        >Subscribe to our newsletter</label
                      >
                      <div class="relative mt-4">
                        <input
                          type="email"
                          name="newsletter"
                          id="newsletter"
                          placeholder="Your email"
                          class="w-full px-4 py-3 ring-1 ring-cyan-700 rounded-xl bg-gray-900 bg-opacity-20 invalid:ring-red-400 invalid:outline-none"
                        />
                        <button
                          type="submit"
                          title="Submit"
                          class="absolute right-0 w-max py-3 px-6 text-center rounded-r-xl transition bg-cyan-400 hover:bg-cyan-300 active:bg-cyan-600 focus:bg-cyan-300"
                        >
                          <span class="text-gray-900 font-semibold"> Send </span>
                        </button>
                      </div>
                    </form>
                  </li>
                </ul>
              </div>
            </div>
            <!-- <div class="py-8 border-t border-cyan-800 text-gray-200 flex justify-between">
              <span>&copy; tailus 2003 - <span id="year"></span></span>
              <span>All right reserved</span>
            </div> -->
          </div>
        </div>
      </div>
    </div>

    <div class="bg-gray-200" style="font-family: Microsoft JhengHei, Helvetica">
      <div class="container mx-auto px-6 py-3 flex justify-center items-center">
        <!-- <a href="#" class="text-xl font-bold text-gray-500 hover:text-gray-400"
          >Vigilero</a
        > -->
        <p class="py-2 text-gray-500 sm:py-0 text-sm">
          <a href="#">
            Copyright © 2022 Vigilero All rights resevered. Images are for educational use
            only, no commercial use.
          </a>
        </p>
      </div>
    </div>
  </footer>
</template>

<script>
import { inject, ref, defineComponent } from "vue";

export default defineComponent({
  props: {
    // specColum: {
    //   type: String,
    //   default: "",
    // },
  },
  setup(props, { emit }) {
    // emit("update:modelValue", _newValues);
    return {};
  },
});
</script>

<style lang="scss" scoped>
.footer-money {
  border-color: #53607f;
}
</style>
